<?php

return [
    'WEEK_SHORT_NAME' => ['日','月','火', '水', '木', '金', '土'],

    'CENTRAL_BAMEI_CODE' => ['01', '02', '03', '04', '05', '06', '07', '08', '09', '10'],
    'REGION_BAMEI_CODE' => ['30', '35', '36', '42', '43', '44', '45', '46', '47', '48', '50', '51', '54', '55', '65'],
    'BAMEI_NAME' => [
        '01' => '札幌'
        ,'02' => '函館'
        ,'03' => '福島'
        ,'04' => '新潟'
        ,'05' => '東京'
        ,'06' => '中山'
        ,'07' => '中京'
        ,'08' => '京都'
        ,'09' => '阪神'
        ,'10' => '小倉'

        ,'30' => '門別'
        ,'35' => '盛岡'
        ,'36' => '水沢'
        ,'42' => '浦和'
        ,'43' => '船橋'
        ,'44' => '大井'
        ,'45' => '川崎'
        ,'46' => '金沢'
        ,'47' => '笠松'
        ,'48' => '名古屋'
        ,'50' => '園田'
        ,'51' => '姫路'
        ,'54' => '高知'
        ,'55' => '佐賀'
        ,'65' => '帯広(ば)'
    ],
    'REGION_TRACK_ID' => [
        '30' => 'monbetsu'
        ,'35' => 'morioka'
        ,'36' => 'mizusawa'
        ,'42' => 'urawa'
        ,'43' => 'funabashi'
        ,'44' => 'ooi'
        ,'45' => 'kawasaki'
        ,'46' => 'kanazawa'
        ,'47' => 'kasamatsu'
        ,'48' => 'nagoya'
        ,'50' => 'sonoda'
        ,'51' => 'himeji'
        ,'54' => 'kouchi'
        ,'55' => 'saga'
        ,'65' => 'obihiro'
    ],

    'GROUND_NAME' => ['','芝','ダート','障害'],
    'GROUND_SHORT_NAME' => ['','芝','ダ','障'],
    'DIRECTION_NAME' => ['','左','右'],

    'BABA_MEMO' => [
        '06' => [
            '1200' => 'スタートから緩やかな下り、前が残りやすい',
        ],
        '42' => [
            '800' => '外枠がやや有利',
            '1300' => '内枠が有利',
            '1400' => '内枠がやや有利',
            '1500' => '真ん中から外枠がやや有利',
            '1600' => '内枠が断然有利',
            '1900' => '内枠がやや有利',
            '2000' => '枠順による有利不利はない'
        ],
        '43' => [
            '1000' => 'スタート五部なら内枠が有利',
            '1200' => '枠順による有利不利はない',
            '1400' => '内枠がやや不利、先行馬は有利',
            '1500' => '内枠がやや有利',
            '1600' => '枠順による有利不利はない',
            '1700' => '枠順による有利不利はない',
            '1800' => '枠順による有利不利はない',
            '2000' => '内枠がやや有利',
            '2400' => '枠順による有利不利はない'
        ],
        '44' => [
            '1000' => '内枠が断然有利',
            '1200' => '内枠の逃げ馬は有利',
            '1400' => '内枠が断然有利',
            '1500' => '内枠の先行馬は有利',
            '1600' => '内枠がやや有利',
            '1700' => '内枠が有利、外枠の先行馬は不利',
            '1800' => '枠順による有利不利はない',
            '2000' => '枠順による有利不利はない',
            '2400' => '内枠が断然有利',
            '2600' => '内枠がやや有利'
        ],
        '45' => [
            '900' => '内枠が有利',
            '1400' => '内枠の先行馬は有利',
            '1500' => '内枠がやや有利',
            '1600' => '枠順による有利不利はない',
            '2000' => '内枠が有利',
            '2100' => '枠順による有利不利はない'
        ]
    ],

    'RACE_CLASS_RANK' => [
        'G1' => 1,
        'G2' => 2,
        'G3' => 3,
        'リステッド' => 4,
        'オープン' => 5,
        '３勝クラス' => 6,
        '２勝クラス' => 7,
        '１勝クラス' => 8,
        '未勝利' => 9,
    ],


    'LOGIN_USER' => '72309c04a625438463229aee18f3d336b34ce46b1663cb294620b747d0e08147',
    'LOGIN_PASS' => '00addb6bb85a52346e8f93f32644a17cd3e9e273b01cd097c9e51845c9896594',

    'SESSION_LOGIN_USER' => 'LOGIN_USER',
    'SESSION_ADMIN' => 'ADMIN_USER',

    'JRA_MOVIE_PAGE' => 'https://www.jra.go.jp/error/error013.html?raceid={raceid}',
    'REGION_MOVIE_PAGE' => 'https://keiba-lv-st.jp/movie/player?track={track}&date={date}&race={raceno}',


    'default' => env('CACHE_DRIVER', 'file')
];
